GenevGitHub/Genev_CC2652R7_Firmware/Application/brake_and_throttle.c
    /******** End compute drpm / dIQ  -  For investigation only   **********/

    /******** Throttle Error Safety Protocol -> when throttle error detected or speed is negative, IQ_input is set to zero
     *  Calculating the IQ Value
     *  Notes: Power is delivered to the motor if:
     *   (1) brake is not engaged
     *   (2) RPM is not negative or is greater than the REG_MINP_RPM
     *   (3) no detected critical hardware / firmware errors
     *  These features are for safety reasons
     **********************************************************************************/
//    throttlePercent = 30;// dummy throttle percent for testing

    /**       if rpm is positive       and   if error is not fatal or critical errors  **/
    if ((ptr_bat_MCUDArray->rpm_status) && (*ptr_bat_errorPriority >= BRAKE_ERROR_PRIORITY))
    {
        if ((brakeStatus) || (RPM_temp < REG_MINP_RPM))
        {
        /*The E-Scooter Stops*/
        /*DRIVE_START = 0 --> Then we don't need to send dynamic Iq messages to the motor controller in order to relieve the UART loads*/
#ifdef ESCOOTER_RUN
            IQ_input = 0;
#endif

#ifdef ESCOOTER_DEBUG
            /*The E-Scooter Starts*/
            /*DRIVE_START = 1 --> The We could send dynamic Iq messages to the motor controller */
            IQ_input = speedModeIQmax * throttlePercent / 100;
#endif
        }
        else
        {
        /*The E-Scooter Starts*/
        /*DRIVE_START = 1 --> The We could send dynamic Iq messages to the motor controller */
            IQ_input = speedModeIQmax * throttlePercent / 100;
        }

    /***** Normal Law: modulated IQ_applied depending on rpm limit and output power limit *********************/
        if (ControlLaw == BRAKE_AND_THROTTLE_NORMALLAW)
        {
            brake_and_throttle_normalLawControl();
        }
        else
        {
            IQ_applied = IQ_input;
        }
    /***** End Normal Law *************************************/

    }
    else
    {
        IQ_input = 0;
        IQ_applied = IQ_input;
    }

    /********************************************************************************************************************************
     * Update IQ_applied to STM32MCPDArray.IQ_value fot commanding Motor via motor controller
     ********************************************************************************************************************************/
    ptr_bat_STM32MCPDArray->IQ_value = IQ_applied;

    // in "brakeAndThrottle_CB(allowableRPM, IQ_input, brakeAndThrottle_errorMsg)", brakeAndThrottle_errorMsg is sent to the motor control unit for error handling if necessary.
    // Add one more conditions in order to fed the power into the motor controller
    // if DRIVE_START == 1 -> then run the command for dynamic Iq, otherwise: ignore it!
//#ifdef CC2640R2_GENEV_5X5_ID

//    motor_control_setIQvalue();         //  this is moved to GPT main loop under N = 1.

//#endif    //CC2640R2_GENEV_5X5_ID

    /***** Increments brakeAndThrottleIndex by 1  ***/
    brakeAndThrottleIndex++;
    if (brakeAndThrottleIndex >= BRAKE_AND_THROTTLE_SAMPLES)
    {
        brakeAndThrottleIndex = 0;
    }

}

/*********************************************************************
 * @fun    brake_and_throttle_normalLawControl
 *
 * @brief   Normal Law Algorithm
 *
 * @param   Nil
 *
 * @return  Nil
 *********************************************************************/
static void brake_and_throttle_normalLawControl()
{
    uint16_t RPM_0;
    /** To get here, RPM status must be 1, i.e., RPM is positive **/
    if (RPM_temp < 1)
    {
        RPM_0 = 1;  // for preventing division by 0 only
    }
    else
    {
        RPM_0 = RPM_temp;
    }

    /*******************************   1. Speed limit Protection  **************************************/
    if (IQ_input == 0)
    {
        IQ_applied = IQ_input;
    }
    else // (IQ_input > 0)    // i.e. (IQ_input != 0)
    {
        if (( RPM_temp < allowableRPM ) && (!limit_exceedance_flag))
        {
            IQ_applied = IQ_input;

        }
        else if (( RPM_temp >= allowableRPM ) && (!limit_exceedance_flag))
        {
            speedModFactor = pow((allowableRPM/(float)RPM_0), exponent);
            IQ_applied = (float)speedModFactor * IQ_input;
            limit_exceedance_flag = 1;  // flag = 1 indicates speed limit is "crossed" from a below limit to above limit

        }
        else if (( RPM_temp >= allowableRPM ) && (limit_exceedance_flag))
        {
            speedModFactor = pow((allowableRPM/(float)RPM_0), exponent);
            IQ_applied = (float)speedModFactor * IQ_applied;

        }
        else if ((RPM_temp < allowableRPM) && (limit_exceedance_flag))    // when (RPM_temp >= allowableRPM), speedModFactor is less than or equal to 1.
        {
            /* The following codes ensures a smooth transition and gradual change in the IQ_applied value
             *  when RPM changes from greater than the speed limit and falling below the speed limit
             *  The sensitivity is adjusted by changing NN_max.                                          */
            IQ_applied = (IQ_input * NN_counter + IQ_applied_old * (NN_max - NN_counter)) / NN_max;
            NN_counter++;
            if (NN_counter > NN_max) // remains in this condition for NN_max number of counts/loops before it can exit
            {
                limit_exceedance_flag = 0;  // exit this condition // flag = 0 indicates speed has "crossed" from above limit to below the speed limit
                NN_counter = 1;             // reset NN_counter
            }
        }
    }

    /**********************  2. Output Power Limit Protection  **********************************************/
    if ((REG_MAXPOUT / (RPM_0 * 2 * PI_CONSTANT / 60) / KT_CONSTANT / KIQ_CONSTANT) > (STM32MCP_TORQUEIQ_MAX / 100 * BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_SPORTS))
    {
        IQ_maxPout = STM32MCP_TORQUEIQ_MAX / 100 * BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_SPORTS;    // make sure the maximum IQ_maxPout value never exceeds STM32MCP_TORQUEIQ_MAX
    }
    else
    {
        IQ_maxPout = REG_MAXPOUT / (RPM_0 * 2 * PI_CONSTANT / 60) / KT_CONSTANT / KIQ_CONSTANT;
    }

    if (IQ_applied > IQ_maxPout)
    {
        IQ_applied = IQ_maxPout;    // making sure IQ applied will not exceed regulatory output power limit
    }

